ClaudioBorges/MicroFEI-SmartCarBrazil2011/TFC - SmartCar/Drivers/Driver_MPC5604B.h
/**
 * MicroFEI Team - SmartCar Brazil 2011
 * Centro Universitário da FEI - http://www.fei.edu.br/
 *
 *  Cesar Osaka     - cesar.osaka@gmail.com
 *  Claudio Borges  - claudio.borges.jr@gmail.com
 *  Munir Mattes    - munir.sp@gmail.com  
 * 
 */

/* ADC channel selection masks */

#define ADC_CHANNEL_0  (0x0001)
#define ADC_CHANNEL_1  (0x0002)
#define ADC_CHANNEL_2  (0x0004)
#define ADC_CHANNEL_3  (0x0008)
#define ADC_CHANNEL_4  (0x0010)

/* Pad Configuration Register value for signals */

#define ANS0 			24 /*PB8*/
#define ANS1 			25 /*PB9*/
#define ANS2 			26 /*PB10*/
#define ANS3 			27 /*PB11*/
#define ANS4 			60 /*PD12*/
#define ANS5 			61 /*PD13*/
#define ANS6 			62 /*PD14*/
#define ANS7 			63 /*PD15*/

#define ANP0 			20 /*PB4*/
#define ANP1 			21 /*PB5*/
#define ANP2 			22 /*PB6*/
#define ANP3 			23 /*PB7*/
#define ANP4 			48 /*PD0*/
#define ANP5 			49 /*PD1*/
#define ANP6 			50 /*PD2*/
#define ANP7 			51 /*PD3*/
#define ANP8 			52 /*PD4*/
#define ANP9 			53 /*PD5*/
#define ANP10 			54 /*PD6*/
#define ANP11 			55 /*PD7*/
#define ANP12 			56 /*PD8*/
#define ANP13 			57 /*PD9*/
#define ANP14 			58 /*PD10*/
#define ANP15 			59 /*PD11*/

#define ANX0 			28 /*PB12*/
#define ANX1 			29 /*PB13*/
#define ANX2 			30 /*PB14*/
#define ANX3 			31 /*PB15*/

#define EMIOS_0_0		0  /*PA0*/
#define EMIOS_0_1		1  /*PA1*/
#define EMIOS_0_2		2  /*PA2*/
#define EMIOS_0_3		3  /*PA3*/
#define EMIOS_0_4		4  /*PA4*/
#define EMIOS_0_5		5  /*PA5*/
#define EMIOS_0_6		6  /*PA6*/
#define EMIOS_0_7		7  /*PA7*/

#define EMIOS_0_8		8  /*PA8*/
#define EMIOS_0_9		9  /*PA9*/
#define EMIOS_0_10		10 /*PA10*/
#define EMIOS_0_11		11 /*PA11*/
#define EMIOS_0_12		44 /*PC12*/
#define EMIOS_0_13		45 /*PC13*/
#define EMIOS_0_14		46 /*PC14*/
#define EMIOS_0_15		47 /*PC15*/

#define EMIOS_0_16		64 /*PE0*/
#define EMIOS_0_17		65 /*PE1*/
#define EMIOS_0_18		66 /*PE2*/
#define EMIOS_0_19		67 /*PE3*/
#define EMIOS_0_20		68 /*PE4*/
#define EMIOS_0_21		69 /*PE5*/
#define EMIOS_0_22		70 /*PE6*/
#define EMIOS_0_23		71 /*PE7*/